bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA256D3.xml
            <value-group caption="External Oscillator Selection and Startup Time" name="OSC_XOSCSEL">
                <value caption="External Clock - 6 CLK" name="EXTCLK" value="0x00"/>
                <value caption="32kHz TOSC - 32K CLK" name="32KHz" value="0x02"/>
                <value caption="0.4-16MHz XTAL - 256 CLK" name="XTAL_256CLK" value="0x03"/>
                <value caption="0.4-16MHz XTAL - 1K CLK" name="XTAL_1KCLK" value="0x07"/>
                <value caption="0.4-16MHz XTAL - 16K CLK" name="XTAL_16KCLK" value="0x0B"/>
            </value-group>
            <value-group caption="PLL Clock Source" name="OSC_PLLSRC">
                <value caption="Internal 2MHz RC Oscillator" name="RC2M" value="0x00"/>
                <value caption="Internal 32MHz RC Oscillator" name="RC32M" value="0x02"/>
                <value caption="External Oscillator" name="XOSC" value="0x03"/>
            </value-group>
            <interrupt-group name="OSC">
                <interrupt index="0" name="OSCF" caption="External Oscillator Failure Interrupt (NMI)"/>
            </interrupt-group>
        </module>
        <module name="DFLL" id="I6055" caption="DFLL">
            <register-group caption="DFLL" name="DFLL" size="8">
                <register caption="Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="DFLL Enable" mask="0x01" name="ENABLE"/>
                </register>
                <register caption="Calibration Register A" name="CALA" offset="0x02" size="1">
                    <bitfield caption="DFLL Calibration bits [6:0]" mask="0x7F" name="CALL"/>
                </register>
                <register caption="Calibration Register B" name="CALB" offset="0x03" size="1">
                    <bitfield caption="DFLL Calibration bits [12:7]" mask="0x3F" name="CALH"/>
                </register>
                <register caption="Oscillator Compare Register 0" name="COMP0" offset="0x04" size="1"/>
                <register caption="Oscillator Compare Register 1" name="COMP1" offset="0x05" size="1"/>
                <register caption="Oscillator Compare Register 2" name="COMP2" offset="0x06" size="1"/>
            </register-group>
        </module>
        <module name="RST" id="I6083" caption="Reset">
            <register-group caption="Reset" name="RST" size="2">
                <register caption="Status Register" name="STATUS" offset="0x00" size="1">
                    <bitfield caption="Spike Detection Reset Flag" mask="0x40" name="SDRF"/>
                    <bitfield caption="Software Reset Flag" mask="0x20" name="SRF"/>
                    <bitfield caption="Programming and Debug Interface Interface Reset Flag" mask="0x10" name="PDIRF"/>
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on Reset Flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Control Register" name="CTRL" offset="0x01" size="1">
                    <bitfield caption="Software Reset" mask="0x01" name="SWRST"/>
                </register>
            </register-group>
        </module>
        <module name="WDT" id="I6078" caption="Watch-Dog Timer">
            <register-group caption="Watch-Dog Timer" name="WDT" size="3">
                <register caption="Control" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="Period" mask="0x3C" name="PER" values="WDT_PER"/>
                    <bitfield caption="Enable" mask="0x02" name="ENABLE"/>
                    <bitfield caption="Change Enable" mask="0x01" name="CEN"/>
                </register>
                <register caption="Windowed Mode Control" name="WINCTRL" offset="0x01" size="1">
                    <bitfield caption="Windowed Mode Period" mask="0x3C" name="WPER" values="WDT_WPER"/>
                    <bitfield caption="Windowed Mode Enable" mask="0x02" name="WEN"/>
                    <bitfield caption="Windowed Mode Change Enable" mask="0x01" name="WCEN"/>
                </register>
                <register caption="Status" name="STATUS" offset="0x02" size="1">
                    <bitfield caption="Syncronization busy" mask="0x01" name="SYNCBUSY"/>
                </register>
            </register-group>
            <value-group caption="Period setting" name="WDT_PER">
                <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
                <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
                <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
                <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
                <value caption="128 cycles (0.128s @ 3.3V)" name="128CLK" value="0x04"/>
                <value caption="256 cycles (0.256s @ 3.3V)" name="256CLK" value="0x05"/>
                <value caption="512 cycles (0.512s @ 3.3V)" name="512CLK" value="0x06"/>
                <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
                <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
                <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
                <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
            </value-group>
            <value-group caption="Closed window period" name="WDT_WPER">
                <value caption="8 cycles (8ms @ 3.3V)" name="8CLK" value="0x00"/>
                <value caption="16 cycles (16ms @ 3.3V)" name="16CLK" value="0x01"/>
                <value caption="32 cycles (32ms @ 3.3V)" name="32CLK" value="0x02"/>
                <value caption="64 cycles (64ms @ 3.3V)" name="64CLK" value="0x03"/>
                <value caption="128 cycles (0.128s @ 3.3V)" name="128CLK" value="0x04"/>
                <value caption="256 cycles (0.256s @ 3.3V)" name="256CLK" value="0x05"/>
                <value caption="512 cycles (0.512s @ 3.3V)" name="512CLK" value="0x06"/>
                <value caption="1K cycles (1s @ 3.3V)" name="1KCLK" value="0x07"/>
                <value caption="2K cycles (2s @ 3.3V)" name="2KCLK" value="0x08"/>
                <value caption="4K cycles (4s @ 3.3V)" name="4KCLK" value="0x09"/>
                <value caption="8K cycles (8s @ 3.3V)" name="8KCLK" value="0x0A"/>
            </value-group>
        </module>
        <module name="MCU" id="I6091" caption="MCU Control">
            <register-group caption="MCU Control" name="MCU" size="12">
                <register caption="Device ID byte 0" name="DEVID0" offset="0x00" size="1"/>
                <register caption="Device ID byte 1" name="DEVID1" offset="0x01" size="1"/>
