bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA256D3.xml
                <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
                    <bitfield caption="Acknowledge Action" mask="0x04" name="ACKACT"/>
                    <bitfield caption="Command" mask="0x03" name="CMD" values="TWI_MASTER_CMD"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x03" size="1">
                    <bitfield caption="Read Interrupt Flag" mask="0x80" name="RIF"/>
                    <bitfield caption="Write Interrupt Flag" mask="0x40" name="WIF"/>
                    <bitfield caption="Clock Hold" mask="0x20" name="CLKHOLD"/>
                    <bitfield caption="Received Acknowledge" mask="0x10" name="RXACK"/>
                    <bitfield caption="Arbitration Lost" mask="0x08" name="ARBLOST"/>
                    <bitfield caption="Bus Error" mask="0x04" name="BUSERR"/>
                    <bitfield caption="Bus State" mask="0x03" name="BUSSTATE" values="TWI_MASTER_BUSSTATE"/>
                </register>
                <register caption="Baud Rate Control Register" name="BAUD" offset="0x04" size="1"/>
                <register caption="Address Register" name="ADDR" offset="0x05" size="1"/>
                <register caption="Data Register" name="DATA" offset="0x06" size="1"/>
            </register-group>
            <register-group caption="" name="TWI_SLAVE" size="6">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Interrupt Level" mask="0xC0" name="INTLVL" values="TWI_SLAVE_INTLVL"/>
                    <bitfield caption="Data Interrupt Enable" mask="0x20" name="DIEN"/>
                    <bitfield caption="Address/Stop Interrupt Enable" mask="0x10" name="APIEN"/>
                    <bitfield caption="Enable TWI Slave" mask="0x08" name="ENABLE"/>
                    <bitfield caption="Stop Interrupt Enable" mask="0x04" name="PIEN"/>
                    <bitfield caption="Promiscuous Mode Enable" mask="0x02" name="PMEN"/>
                    <bitfield caption="Smart Mode Enable" mask="0x01" name="SMEN"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Acknowledge Action" mask="0x04" name="ACKACT"/>
                    <bitfield caption="Command" mask="0x03" name="CMD" values="TWI_SLAVE_CMD"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x02" size="1">
                    <bitfield caption="Data Interrupt Flag" mask="0x80" name="DIF"/>
                    <bitfield caption="Address/Stop Interrupt Flag" mask="0x40" name="APIF"/>
                    <bitfield caption="Clock Hold" mask="0x20" name="CLKHOLD"/>
                    <bitfield caption="Received Acknowledge" mask="0x10" name="RXACK"/>
                    <bitfield caption="Collision" mask="0x08" name="COLL"/>
                    <bitfield caption="Bus Error" mask="0x04" name="BUSERR"/>
                    <bitfield caption="Read/Write Direction" mask="0x02" name="DIR"/>
                    <bitfield caption="Slave Address or Stop" mask="0x01" name="AP"/>
                </register>
                <register caption="Address Register" name="ADDR" offset="0x03" size="1"/>
                <register caption="Data Register" name="DATA" offset="0x04" size="1"/>
                <register caption="Address Mask Register" name="ADDRMASK" offset="0x05" size="1">
                    <bitfield caption="Address Mask" mask="0xFE" name="ADDRMASK"/>
                    <bitfield caption="Address Enable" mask="0x01" name="ADDREN"/>
                </register>
            </register-group>
            <register-group caption="Two-Wire Interface" name="TWI" size="14">
                <register caption="TWI Common Control Register" name="CTRL" offset="0x00" size="1">
                    <bitfield caption="SDA Hold Time Enable" mask="0x06" name="SDAHOLD" values="SDA_HOLD_TIME"/>
                    <bitfield caption="External Driver Interface Enable" mask="0x01" name="EDIEN"/>
                </register>
                <register-group caption="TWI master module" name="MASTER" offset="0x0001" name-in-module="TWI_MASTER"/>
                <register-group caption="TWI slave module" name="SLAVE" offset="0x0008" name-in-module="TWI_SLAVE"/>
            </register-group>
            <value-group caption="Master Interrupt Level" name="TWI_MASTER_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Inactive Timeout" name="TWI_MASTER_TIMEOUT">
                <value caption="Bus Timeout Disabled" name="DISABLED" value="0x00"/>
                <value caption="50 Microseconds" name="50US" value="0x01"/>
                <value caption="100 Microseconds" name="100US" value="0x02"/>
                <value caption="200 Microseconds" name="200US" value="0x03"/>
            </value-group>
            <value-group caption="Master Command" name="TWI_MASTER_CMD">
                <value caption="No Action" name="NOACT" value="0x00"/>
                <value caption="Issue Repeated Start Condition" name="REPSTART" value="0x01"/>
                <value caption="Receive or Transmit Data" name="RECVTRANS" value="0x02"/>
                <value caption="Issue Stop Condition" name="STOP" value="0x03"/>
            </value-group>
            <value-group caption="Master Bus State" name="TWI_MASTER_BUSSTATE">
                <value caption="Unknown Bus State" name="UNKNOWN" value="0x00"/>
                <value caption="Bus is Idle" name="IDLE" value="0x01"/>
                <value caption="This Module Controls The Bus" name="OWNER" value="0x02"/>
                <value caption="The Bus is Busy" name="BUSY" value="0x03"/>
            </value-group>
            <value-group caption="Slave Interrupt Level" name="TWI_SLAVE_INTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Slave Command" name="TWI_SLAVE_CMD">
                <value caption="No Action" name="NOACT" value="0x00"/>
                <value caption="Used To Complete a Transaction" name="COMPTRANS" value="0x02"/>
                <value caption="Used in Response to Address/Data Interrupt" name="RESPONSE" value="0x03"/>
            </value-group>
            <value-group caption="SDA hold time" name="SDA_HOLD_TIME">
                <value caption="SDA hold time off" value="0x00" name="OFF"/>
                <value caption="Typical 50ns hold time" value="0x01" name="50NS"/>
                <value caption="Typical 300ns hold time" value="0x2" name="300NS"/>
                <value caption="Typical 400ns hold time" value="0x03" name="400NS"/>
            </value-group>
