bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA256D3.xml
                <register caption="Fault Detection Event Mask" name="FDEMASK" offset="0x02" size="1"/>
                <register caption="Fault Detection Control Register" name="FDCTRL" offset="0x03" size="1">
                    <bitfield caption="Fault Detect on Disable Break Disable" mask="0x10" name="FDDBD"/>
                    <bitfield caption="Fault Detect Mode" mask="0x04" name="FDMODE"/>
                    <bitfield caption="Fault Detect Action" mask="0x03" name="FDACT" values="AWEX_FDACT"/>
                </register>
                <register caption="Status Register" name="STATUS" offset="0x04" size="1">
                    <bitfield caption="Fault Detect Flag" mask="0x04" name="FDF"/>
                    <bitfield caption="Dead Time High Side Buffer Valid" mask="0x02" name="DTHSBUFV"/>
                    <bitfield caption="Dead Time Low Side Buffer Valid" mask="0x01" name="DTLSBUFV"/>
                </register>
                <register caption="Dead Time Both Sides" name="DTBOTH" offset="0x06" size="1"/>
                <register caption="Dead Time Both Sides Buffer" name="DTBOTHBUF" offset="0x07" size="1"/>
                <register caption="Dead Time Low Side" name="DTLS" offset="0x08" size="1"/>
                <register caption="Dead Time High Side" name="DTHS" offset="0x09" size="1"/>
                <register caption="Dead Time Low Side Buffer" name="DTLSBUF" offset="0x0A" size="1"/>
                <register caption="Dead Time High Side Buffer" name="DTHSBUF" offset="0x0B" size="1"/>
                <register caption="Output Override Enable" name="OUTOVEN" offset="0x0C" size="1"/>
            </register-group>
            <register-group caption="High-Resolution Extension" name="HIRES" size="1">
                <register caption="Control Register" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="High Resolution Enable" mask="0x03" name="HREN" values="HIRES_HREN"/>
                </register>
            </register-group>
            <value-group caption="Clock Selection" name="TC_CLKSEL">
                <value caption="Timer Off" name="OFF" value="0x00"/>
                <value caption="System Clock" name="DIV1" value="0x01"/>
                <value caption="System Clock / 2" name="DIV2" value="0x02"/>
                <value caption="System Clock / 4" name="DIV4" value="0x03"/>
                <value caption="System Clock / 8" name="DIV8" value="0x04"/>
                <value caption="System Clock / 64" name="DIV64" value="0x05"/>
                <value caption="System Clock / 256" name="DIV256" value="0x06"/>
                <value caption="System Clock / 1024" name="DIV1024" value="0x07"/>
                <value caption="Event Channel 0" name="EVCH0" value="0x08"/>
                <value caption="Event Channel 1" name="EVCH1" value="0x09"/>
                <value caption="Event Channel 2" name="EVCH2" value="0x0A"/>
                <value caption="Event Channel 3" name="EVCH3" value="0x0B"/>
                <value caption="Event Channel 4" name="EVCH4" value="0x0C"/>
                <value caption="Event Channel 5" name="EVCH5" value="0x0D"/>
                <value caption="Event Channel 6" name="EVCH6" value="0x0E"/>
                <value caption="Event Channel 7" name="EVCH7" value="0x0F"/>
            </value-group>
            <value-group caption="Waveform Generation Mode" name="TC_WGMODE">
                <value caption="Normal Mode" name="NORMAL" value="0x00"/>
                <value caption="Frequency Generation Mode" name="FRQ" value="0x01"/>
                <value caption="Single Slope" name="SS" value="0x03"/>
                <value caption="Dual Slope, Update on TOP" name="DS_T" value="0x05"/>
                <value caption="Dual Slope, Update on TOP and BOTTOM" name="DS_TB" value="0x06"/>
                <value caption="Dual Slope, Update on BOTTOM" name="DS_B" value="0x07"/>
            </value-group>
            <value-group caption="Event Action" name="TC_EVACT">
                <value caption="No Event Action" name="OFF" value="0x00"/>
                <value caption="Input Capture" name="CAPT" value="0x01"/>
                <value caption="Externally Controlled Up/Down Count" name="UPDOWN" value="0x02"/>
                <value caption="Quadrature Decode" name="QDEC" value="0x03"/>
                <value caption="Restart" name="RESTART" value="0x04"/>
                <value caption="Frequency Capture" name="FRQ" value="0x05"/>
                <value caption="Pulse-width Capture" name="PW" value="0x06"/>
            </value-group>
            <value-group caption="Event Selection" name="TC_EVSEL">
                <value caption="No Event Source" name="OFF" value="0x00"/>
                <value caption="Event Channel 0" name="CH0" value="0x08"/>
                <value caption="Event Channel 1" name="CH1" value="0x09"/>
                <value caption="Event Channel 2" name="CH2" value="0x0A"/>
                <value caption="Event Channel 3" name="CH3" value="0x0B"/>
                <value caption="Event Channel 4" name="CH4" value="0x0C"/>
                <value caption="Event Channel 5" name="CH5" value="0x0D"/>
                <value caption="Event Channel 6" name="CH6" value="0x0E"/>
                <value caption="Event Channel 7" name="CH7" value="0x0F"/>
            </value-group>
            <value-group caption="Error Interrupt Level" name="TC_ERRINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Overflow Interrupt Level" name="TC_OVFINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture D Interrupt Level" name="TC_CCDINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Compare or Capture C Interrupt Level" name="TC_CCCINTLVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
